Revit 2027 API
ExporterIFCUtils.TransformAndScaleVector Method
 Converts a vector from global Revit coordinates to current IFC coordinates, including scale.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ TransformAndScaleVector(
	ExporterIFC exporterIFC,
	XYZ origVector
)
Public Shared Function TransformAndScaleVector (
	exporterIFC As ExporterIFC,
	origVector As XYZ
) As XYZ
public:
static XYZ^ TransformAndScaleVector(
	ExporterIFC^ exporterIFC,
	XYZ^ origVector
)
static member TransformAndScaleVector :
        exporterIFC : ExporterIFC *
        origVector : XYZ -> XYZ
Parameters
exporterIFC ExporterIFC
 The exporter.
origVector XYZ
 The original vector.
Return Value
XYZ
 The transformed and scaled point.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace